{
  "name": "root",
  "type": "dir",
  "children": [
    {
      "name": "Macrolog Interstellar",
      "description": "MACROLOG — PUBLIC CORPORATE REGISTRY (CR-8839A)\nRev 13.04.105 AE | Ultima’s Rest DataNet Node\n\n# CORPORATE OVERVIEW\n  Industry......... Freight logistics, infrastructure, resource relocation\n  Founded.......... Post-Expansion Era (Date Classified)\n  HQ Location...... Margulis Station, orbiting Nova Fane IV\n  Alignment........ Lawful Neutral\n  Scope............ Intergalactic\n\n# DESCRIPTION\n  Macrolog is one of the galaxy’s largest logistics and infrastructure firms.\n  Known for freight architecture, orbital delivery systems, and sector-wide\n  transport lanes, it functions as the backbone of modern interstellar trade.\n\n  With operations from frontier mining outposts to megastructure assembly\n  platforms, Macrolog’s systems power planetary development, stabilize high-\n  traffic drift corridors, and support both civilian and military transport needs.\n\n  The company is minimally communicative with the public. It does not\n  advertise and offers no direct civilian contact channels. Nonetheless, its\n  systems are everywhere—from spaceport cargo lifts to automated fuel nodes.\n\n# COMMON INTERFACES\n  Most citizens interact with Macrolog indirectly:\n    - Freight handling via authorized ports\n    - Refueling stations using Macrolog standards\n    - Routing assistance for licensed haulers\n\n  Freelancers may access limited job postings or refit stations at tiered\n  terminals across key sectors, especially near the Aurora corridor.\n\n# PUBLIC SERVICES (TIER-0 ACCESS)\n  - Cargo processing at authorized hubs\n  - Interstellar routing (license required)\n  - Refueling & repair nodes (fees apply)\n  - Freelance contract boards (location-based)\n\n# STATUS\n  - Operational in all major sectors\n  - High activity: North Sector (Aurora) & Central Sector\n\n# CONTACT\n  - No public line available\n  - Use licensed brokerage terminals for inquiries\n\n# LEGAL NOTICE\n  - Tampering with Macrolog infrastructure is a Class-2 offense under\n  - intersector compliance law. Violators may face prosecution or blacklisting.\n\nFile Authority: Macrolog Public Access Console – Node 12X",
      "type": "file"
    },
    {
      "name": "Halosyn Innovations",
      "description": "HALOSYN INNOVATIONS — PUBLIC CORPORATE REGISTRY (CR-1192B)\nRev 13.04.105 AE | Ultima’s Rest DataNet Node\n\n# CORPORATE OVERVIEW\n  Industry......... Magitech research, biotech augmentation, arcane systems\n  Founded.......... Post-Expansion Era (73.11.89 AE)\n  HQ Location...... Zenith Axis Laboratory, Central Orbit\n  Alignment........ Neutral\n  Scope............ Intergalactic\n\n# DESCRIPTION\n  HaloSyn Innovations is a premier developer of arcane-biological systems and\n  high-tier magitech infrastructure. The company rose to fame after commercializing\n  the first spell-dampener array—now mandatory on nearly all spaceport decks.\n\n  Headquartered in orbit above Central, HaloSyn controls multiple sealed test moons\n  and Geneforge stations, where cutting-edge research on regenerative mycelial\n  grafts, drift-reactive alloys, and spell-linked consciousness systems takes place.\n\n  Though it markets itself as an ethical innovator, HaloSyn maintains tight control\n  over its intellectual property and public image. Its battle-caster consultants are\n  licensed but operate independently from standard sector forces.\n\n  Speculation persists around its covert survey missions in The Wilds, though the\n  corporation officially denies any unsanctioned exploration or anomaly retrieval\n  efforts. All inquiries about Wilds research are redirected to Legal Affairs.\n\n# COMMON INTERFACES\n  Most civilians encounter HaloSyn via:\n  - Bio-enhancement clinics (licensed affiliates)\n  - Spell-dampener modules in spaceport security zones\n  - Corporate-sponsored healthcare contracts (Mid-High tier)\n\n# PUBLIC SERVICES (TIER-0 ACCESS)\n  - Basic diagnostic access at licensed clinics\n  - Emergency spell-dampener replacement\n  - Combat implant recall stations\n  - Consultation request forms\n\n# STATUS\n  - Fully operational across all sectors\n  - High activity: Central Sector (Core), classified activity in North\n\n# CONTACT\n  - Official node: halosyn.corp.axis.nexus\n  - Public requests must be routed through verified health or defense liaisons\n\n# LEGAL NOTICE\n  - Unauthorized duplication of HaloSyn implants, devices, or arcane schematics\n  - is a Class-3 offense under Central Arcane Compliance Authority. All tampering\n  - will be investigated by licensed enforcers or contract casters.\n\nFile Authority: HaloSyn Innovations – Central Node Aether.92C\nNote: All field augmentation data is sealed under intellectual property clause CR-X7A.",
      "type": "file"
    },
    {
      "name": "OmniNet Systems",
      "description": "OMNINET SYSTEMS — PUBLIC CORPORATE REGISTRY (CR-1440X)\nRev 13.04.105 AE | Ultima’s Rest DataNet Node\n\nCORPORATE OVERVIEW\nIndustry......... Communications, data infrastructure, predictive analytics\nFounded.......... Post-Expansion Era (61.02.76 AE)\nHQ Location...... Horizon Stack Spire, West Sector\nAlignment........ Neutral\nScope............ Intergalactic\n\nDESCRIPTION\nOmniNet Systems operates the galaxy’s most pervasive communications network,\ncontrolling the intersector Drift-linked mesh that powers everything from\nreal-time messaging to civil unrest modeling. Its invention of Drift-Thread\nRouting made instant data transfer across vast distances possible—cementing\nOmniNet’s role as both information provider and cultural architect.\n\nThrough “The Flow,” its adaptive neural data mesh, OmniNet syndicates nearly\nall major media feeds, sentiment channels, and memetic trends. Governments\nrely on its predictive analytics division to monitor public opinion, while\ncorporations pay for access to influence tools and trend amplifiers.\n\nThough it claims to offer free and open connectivity, OmniNet monetizes every\ndatapoint it touches, refining behavior profiles and emotional telemetry\nacross billions of users. Its rivalry with HaloSyn over thought-interface tech\nhas triggered high-profile data thefts, blacksite leaks, and media warfare.\n\nCOMMON INTERFACES\nMost civilians encounter OmniNet via:\n- Holo-streaming platforms and newsfeeds\n- OmniDrift terminal relays (public and private access)\n- SectorNet translation layers and comms boosters\n\nPUBLIC SERVICES (TIER-0 ACCESS)\n- Standard intersector DriftNet access (limited bandwidth)\n- Language and protocol sync via OmniSync™\n- Archive query interface (subject to packet limits)\n- Complaint and feedback channel (auto-flagged, rarely responded to)\n\nSTATUS\n- Fully operational galaxy-wide\n- Critical infrastructure tier in all sectors (mandatory Drift relay presence)\n\nCONTACT\n- Official node: omninet.stack.grid.horizon\n- Flow-based queries require Level-1 identity tethering\n\nLEGAL NOTICE\n- Disruption of OmniNet relay systems, or unlicensed duplication of\n- Drift-threading algorithms, constitutes a Core Digital Security Violation.\n- Per Sector Law, OmniNet reserves the right to revoke mesh access without notice.\n\nFile Authority: OmniNet Systems – Grid Node 7-Alpha.HZN\nNote: All mesh interactions subject to behavioral modeling and synaptic caching.",
      "type": "file"
    },
    {
      "name": "Black Market Collective",
      "description": "BLACK MARKET COLLECTIVE — PUBLIC NETWORK REGISTRY (UN-421B)\nRev 13.04.105 AE | Ultima’s Rest DataNet Node\n\nOVERVIEW\nClassification..... Unlicensed Freight Entity (Tier-3 Contraband Risk)\nRegistry Status.... Non-compliant / Irregular Node Signatures\nRegion of Concern.. Drift-border zones; heightened activity near WB1\nOrganizational ID.. [REDACTED]\nAlignment.......... Undeclared\n\nDESCRIPTION\nThe entity commonly referred to as the Black Market Collective (BMC) is under\nongoing investigation for suspected violations of Concordium Trade Mandates\nsections 12.4.a, 12.4.c, and 19.7-f.\n\nAlthough no formal structure has been confirmed, intelligence suggests a loose\nconfederation of unregistered freight operators and data-brokers utilizing\n[REDACTED] drift-tag protocols to navigate through regulated space.\n\nSeveral sectors have reported recurring cargo irregularities matching known\nBMC behavioral patterns, including:\n\n– Spoofed transponder identities resembling MacroLog credentials\n– Disappearance and re-emergence of containers marked “lost” or “destroyed”\n– Movement of prohibited materials across embargo lines\n\nItems recovered from associated raids have included:\n- [REDACTED – SEE ARC-SEC 77.2]\n- Unlicensed spellcore arrays\n- Biogenic containers of unknown origin\n\nThough the entity has no known headquarters, repeat vector traces suggest\npatterned use of [REDACTED - LOCATION CLASSIFIED] within Wilds-adjacent drift corridors.\n\nNOTICE TO CIVILIANS\n- Transporting goods on behalf of non-certified freight agents carries civil\nand criminal penalties under intersector law.\n- Possession of BMC-linked cargo constitutes grounds for detainment and\nautomatic cargo seizure.\n- Interaction with known BMC affiliates may result in temporary ID lockout\nat compliant stations.\n\nFile Authority: Drift Enforcement Node AUR-8 / North Sector Office of Freight Security",
      "type": "file"
    }
  ]
}